Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of telmate/proxmox from the dependency lock file
- Installing telmate/proxmox v3.0.1-rc3...
- Installed telmate/proxmox v3.0.1-rc3. Signature validation was skipped due to the registry not containing GPG keys for this provider

OpenTofu has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

proxmox_vm_qemu.vm-202: Preparing import... [id=pve/qemu/202]
proxmox_vm_qemu.vm-202: Refreshing state... [id=pve/qemu/202]
proxmox_vm_qemu.vm-501: Refreshing state... [id=pve/qemu/501]
proxmox_vm_qemu.vm-106: Refreshing state... [id=pve/qemu/106]
proxmox_vm_qemu.vm-502: Refreshing state... [id=pve/qemu/502]
proxmox_vm_qemu.vm-500: Refreshing state... [id=pve/qemu/500]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # proxmox_vm_qemu.vm-106 will be updated in-place
  ~ resource "proxmox_vm_qemu" "vm-106" {
      ~ agent                  = 0 -> 1
      + default_ipv4_address   = (known after apply)
        id                     = "pve/qemu/106"
        name                   = "vm-106"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      ~ vm_state               = "stopped" -> "running"
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.vm-202 will be updated in-place
  # (imported from "pve/qemu/202")
  ~ resource "proxmox_vm_qemu" "vm-202" {
      + additional_wait        = 5
        agent                  = 1
      + automatic_reboot       = true
        balloon                = 0
        bios                   = "seabios"
        boot                   = "order=scsi0;ide2"
      + clone_wait             = 10
        cores                  = 24
        cpu                    = "host,flags=+aes"
        define_connection_info = false
      - desc                   = "hostpci0: 0000:04:00" -> null
        force_create           = false
        full_clone             = false
        hotplug                = "network,disk,usb"
        id                     = "pve/qemu/202"
        kvm                    = true
        linked_vmid            = 0
        memory                 = 16384
        name                   = "homelab"
        numa                   = false
        onboot                 = true
        protection             = false
        qemu_os                = "l26"
        reboot_required        = false
        scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = false
        sockets                = 1
        startup                = "order=3,up=60"
        tablet                 = true
        unused_disk            = []
        vcpus                  = 0
        vm_state               = "running"

      ~ disks {
          - ide {
              - ide2 {
                  - cdrom {
                      - iso         = "local:iso/debian-12.5.0-amd64-netinst.iso" -> null
                      - passthrough = false -> null
                    }
                }
            }
            scsi {
                scsi0 {
                    disk {
                        backup               = true
                        cache                = "writeback"
                        discard              = false
                        emulatessd           = true
                        format               = "raw"
                        id                   = 0
                        iops_r_burst         = 0
                        iops_r_burst_length  = 0
                        iops_r_concurrent    = 0
                        iops_wr_burst        = 0
                        iops_wr_burst_length = 0
                        iops_wr_concurrent   = 0
                        iothread             = true
                        linked_disk_id       = -1
                        mbps_r_burst         = 0
                        mbps_r_concurrent    = 0
                        mbps_wr_burst        = 0
                        mbps_wr_concurrent   = 0
                        readonly             = false
                        replicate            = true
                        size                 = "640G"
                        storage              = "local-lvm"
                    }
                }
            }
        }

        network {
            bridge    = "vmbr1"
            firewall  = true
            link_down = false
            macaddr   = "BC:24:11:8F:B4:06"
            model     = "virtio"
            mtu       = 0
            queues    = 0
            rate      = 0
            tag       = -1
        }
        network {
            bridge    = "vmbr0"
            firewall  = true
            link_down = false
            macaddr   = "BC:24:11:D3:3F:F6"
            model     = "virtio"
            mtu       = 0
            queues    = 0
            rate      = 0
            tag       = -1
        }

        smbios {
            uuid = "76e32991-febf-42a1-8ece-1cf9e7dc7476"
        }
    }

Plan: 1 to import, 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://10.0.1.108:80/lock?id=kareemlukitomo%252Fhomelab-terraform%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 1 to import, 0 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```